# coding: utf-8
#***************************************************************************
#validates　format　with
#***************************************************************************
#ASCIIのみ
ASCII_CHAR = /\A[\x20-\x7E]*\z/n
#半角英数字と - _ のみ
VALID_DIR_CHAR = /\A[0-9a-zA-Z\-\_\.]*\z/n
INVALID_DIR_CHAR =  /[^0-9a-zA-Z\-\_\.]/
#電話番号
PHONE_NUMBER =  /\A[\(\)0-9\- \+\.]{10,20} *[extension\.]{0,9} *[0-9]{0,5}\z/i
#E-mail
EMAIL_REGEX = /\A[a-zA-Z0-9!$&*.=^`|~#%'+\/?_{}-]+@([a-zA-Z0-9_-]+\.)+[a-zA-Z]{2,4}\z/
# 郵便番号
POST_CODE = /\A[0-9]{3}-?[0-9]{4}\z/
MIN_INT = -1_000_000_000
MAX_INT =  1_000_000_000
MAX_INT_LIMIT3 = 1_000_000

#***************************************************************************
#共通選択肢
#***************************************************************************
BLANK_SET = ["",""]
SERCH_ALL = [":all",""]

UMU_LIST = [["有","1"],["無","0"]]
KAFUKA_LIST = [["可","1"],["不可","2"]]
KAFUKA_MARK = [["○","1"],["×","2"]]
CONFIRM = [["未確認","0"],["確認済","1"]]

#***************************************************************************
#固定値
#***************************************************************************
#1ページ表示件数
LIST_LIMIT = 20

UserSessionKey = :user
#許可IP格納環境変数
ALLOW_IP_ENV_KEY = "ALLOW_IPS_NNKEVT"
#外部API
AJAX_ZIP_3 = "https://ajaxzip3.github.io/ajaxzip3.js"
#アップロード可能な最大ファイルサイズ(Mb)
MAX_FILE_SIZE_MB = 5
MAX_FILE_SIZE = MAX_FILE_SIZE_MB.megabyte

#画像ファイル置き場
IMG_URL = "system"
IMG_DIR = "public/#{  }"
#PDF出力関係
PDF_OUT_DIR = 'tmp/pdf'
#帳票出力作業ディレクトリ
FILE_OUT_DIR = 'tmp/file_work'
#ファイル名、パスに使用できない文字
UN_USERD_CHA_LIST = {
  "\\"=>"￥",
  "/"=>"／",
  ":"=>"：",
  "*"=>"＊",
  "?"=>"？",
  "\""=>"”",
  "<"=>"＜",
  ">"=>"＞",
  "|"=>"｜",}



  
  
  
  
  
#***************************************************************************
#カレンダー
#***************************************************************************
#決算月
ClosingMonth = 12
#締め日(0は月末
ClosingDate = 0

#月度が前月、後月どちらを採用するか
# [ClosingDate]の月に加減
#  例) 2026/01/31
#    設定値 : -1 -> 2025年12月度
#    設定値 : 0  -> 2026年01月度 
#    設定値 : 1  -> 2026年02月度
MonthBoundaryRule = 0

#***************************************************************************
#外部連携
#***************************************************************************


